//程序功能：输入圆的半径和圆周率，求圆的周长和面积。要求使用C++的标准输入流cin和标准输出流
//          cout进行输入和输出，用setw设置域宽，有setprecision设置精度。
//注    意：除在指定位置添加语句外，不要改动程序其他内容，补充语句不限一句，可多句。

#include <iostream>
#include <iomanip>
using namespace std;

int main()
{
	double p,r,c,s;
	cout<<"请输入圆的半径：";
	cin>>r;

	cout<<"请输入圆周率：";
	//请在两条星线间填入代码，输入圆周率，并计算周长和面积
	/******************************************************/



	/******************************************************/

	cout<<"圆周长="<<setw(8)<<c<<endl; //设置域宽为8

	//请在两条星线间填入代码，输出面积，设置域宽为8、精度为6
	/******************************************************/


	/******************************************************/ 

	return 0;
}